---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.AlternateUnits
source: html/c6e3383f-be38-6738-5d7e-18487fa01de5.htm
---
# Autodesk.Revit.DB.DimensionType.AlternateUnits Property

The alternate units display mode for this DimensionType.

## Syntax (C#)
```csharp
public AlternateUnits AlternateUnits { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration